src/stage-1-prototype/InformationRegisters/Расш1_СвязиЗаказовБ24.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>Расш1_СвязиЗаказовБ24</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗадачаId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОперацияId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/stage-1-prototype/InformationRegisters/Расш1_СвязиЗаказовБ24/Ext/RecordSetModule.bsl
// Прототип: защита любой записи в собственный регистр внутри транзакции платформы.
Процедура ПередЗаписью(Отказ, Замещение)
    Блокировка = Новый БлокировкаДанных;
    Область = Блокировка.Добавить("РегистрСведений.Расш1_СвязиЗаказовБ24");
    Область.Режим = РежимБлокировкиДанных.Исключительный;
    Блокировка.Заблокировать();
    ЗадачиНабора = Новый Соответствие;
    ОперацииНабора = Новый Соответствие;
    Для Каждого Связь Из ЭтотОбъект Цикл
        Если Не ЗначениеЗаполнено(Связь.Заказ) Или Не ЗначениеЗаполнено(Связь.ЗадачаId) Тогда
            ВызватьИсключение "STAGE1_INVALID_LINK";
        КонецЕсли;
        Если ЗадачиНабора.Получить(Связь.ЗадачаId) <> Неопределено Тогда
            ВызватьИсключение "STAGE1_TASK_CONFLICT";
        КонецЕсли;
        ЗадачиНабора.Вставить(Связь.ЗадачаId, Связь.Заказ);
        Если ОперацииНабора.Получить(Связь.ОперацияId) <> Неопределено Тогда
            ВызватьИсключение "STAGE1_OPERATION_CONFLICT";
        КонецЕсли;
        ОперацииНабора.Вставить(Связь.ОперацияId, Связь.Заказ);
        Запрос = Новый Запрос;
        Запрос.Текст = "ВЫБРАТЬ Заказ, ЗадачаId, ОперацияId
            |ИЗ РегистрСведений.Расш1_СвязиЗаказовБ24
            |ГДЕ Заказ = &Заказ ИЛИ ЗадачаId = &ЗадачаId ИЛИ ОперацияId = &ОперацияId";
        Запрос.УстановитьПараметр("Заказ", Связь.Заказ);
        Запрос.УстановитьПараметр("ЗадачаId", Связь.ЗадачаId);
        Запрос.УстановитьПараметр("ОперацияId", Связь.ОперацияId);
        Выборка = Запрос.Выполнить().Выбрать();
        Пока Выборка.Следующий() Цикл
            Если Выборка.Заказ <> Связь.Заказ Или Выборка.ЗадачаId <> Связь.ЗадачаId
                Или Выборка.ОперацияId <> Связь.ОперацияId Тогда
                ВызватьИсключение "STAGE1_LINK_CONFLICT";
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;
КонецПроцедуры
